package com.example.judur;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;
import android.provider.MediaStore;

import java.util.ArrayList;

public class MainActivity_app extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main_app);

        ArrayList<food> Appetizars = new ArrayList<>();

        food fo5 = new food("شوربة يقطين", R.drawable.ga, "\n" +
                "ملعقتان كبيرتان من الزبدة. حبّة صغيرة من البصل المفروم. ضمة من الكرفس المفروم. حبّة متوسِّطة الحجم من الجزر المُقطَّع. حبّتان متوسِّطتا الحجم من البطاطا المُقطَّعة إلى مُكعّبات. حبّة متوسِّطة الحجم من القرع مُقشَّر ومنزوع من البذور ومُقطَّع إلى مُكعّبات. علبة من مرق الدجاج السائل. ملح وفلفل أسود حسب الرغبة.\n" +
                "\n", "\n" +
                "نُذيب الزبدة في قدر كبير، ونطبخ به الخضار لمدّة خمس دقائق أو حتّى يتحول لون الخضار إلى اللَّون البُنيّ. نسكب كميّة من مرق الدجاج؛ بحيث تُغطّي كافة الخضار، ونترك القدر على النَّار حتّى يغلي المرق. نُقلّل الحرارة، ونُغطي القدر ونتركها لثلثي الساعة حتّى تُصبح الخضار طريّة. نخلط المكوّنات مع المرق في الخلاّط حتّى يتشكل لدينا خليط مُتجانس. نُعيد الخليط إلى القدر، ونخلطه مع ما تبقّى من المرق إلى أن نحصل على الكثافة الَّتي نرغب بها، ونُبهّر بالملح والفلفل الأسود\n" +
                "\n",
                "https://youtu.be/fNQ_BPIEg-s" , "https://jm3eia.com/");

        food fo2 = new food("سلطة فاصوليا بالذرة", R.drawable.fa, "علبة من كلٍ من: الفاصولياء البيضاء العريضة. الفاصولياء الحمراء. الفاصولياء البيضاء الصغيرة. الذرة الحب. عودان من البصل الأخضر المفروم مع الأوراق. كوبان من الفاصولياء الخضراء المسلوقة. \n" +
                "مكونات الصلصلة : ربع كوب من الخل الأبيض. نصف كوب من زيت الزيتون. ثلاث ملاعق كبيرة من خل البلسميك. ثلاثة فصوص من الثوم المهروس. بصلة صغيرة مفرومة ناعماً. ملعقة كبيرة من كلٍ من: معجون الخردل (مستردة). الريحان المجفف. الأوريجانو المجفف. ربع ملعقة صغيرة من الفلفل الأسود. قرن فلفل أخضر حار، مفروم ناعم. ملعقة صغيرة من كلٍ من: الشطة المجروشة. الملح. البصل البودرة.\n" +
                "\n", "\n" +
                "وضع الفاصولياء الحمراء داخل طبق عميق، ثمّ إضافة الفاصولياء البيضاء العريضة والفاصولياء الخضراء والفاصولياء البيضاء والبصل والذرة، والتقليب باستخدام ملعقة عريضة. وضع مكونات الصلصة داخل طبق عميق والخفق بواسطة مضرب يدوي حتى الحصول على صلصة متجانسة. توزيع الصلصة على السلطة والتقليب حتى اختلاط الصلصة مع الخضراوات. وضع السلطة داخل الثلاجة لعدة ساعات حتى تتشرب الخضار بنكهة الصلصة. فرش الخس داخل أطباق تقديم منفردة وتوزيع السلطة فيه، ثمّ تقديمها على الفور.\n" +
                "\n",
                "https://youtu.be/2gNHgrKX0j0" , "https://jm3eia.com/");

        food fo3 = new food("شوربة عدس", R.drawable.ad, "كوب من العدس الاصفر. جرام من الزبدة غير المملحه. بصلة واحده متوسطة الحجم. حبتان من البطاطا متوسطة الحجم. ثلاث حبت جزر. ملعقه صغيره كمون وفلفل اسود. خمسة اكواب من الماء المغلي. ملعقة كبيرة ملح. نصف ملعقة صغيرة كركم.\n" +
                "\n", "\n" +
                "نغسل العدس وتقطيع البطاطاس لمكعبات وبشر الجزر، نضع الزبدة في المقلاة لإذابتها نضع العدس والبطاطس والجزر والبصل في القدر ونحركهم ،نضع الماء المغلي في القدر حتى تنضج جميع المقادير لمدة 45 دقيقة ثم نضعهم في الخلاطة ،نضع الخليط في القدر مجددا ونضيف الملح والفلفل والكركم والكمون ،نضعها في الطبق وللتزيين نستخدم ملعقتين من الزبدة لإضافة نكهة وكزبرة.\n",
                "https://youtu.be/RAJakgbKRnI" , "https://jm3eia.com/");
        food fo4 = new food("حمص", R.drawable.hm, "\n" +
                "1.\tحمص : ملعقة كبيرة (مسلوق) - بقدونس : ملعقة كبيرة (مفروم) - حمص : كوب ونصف (منقوع في الماء لليلة كاملة مع ملعقة صغيرة من بيكربونات الصوديوم) - الثوم : 3 فصوص - عصير الليمون : 4 ملاعق كبيرة (حامض) - الطحينية : 2 ملعقة كبيرة - ملح : ملعقة صغيرة - فلفل أسود : ربع ملعقة صغيرة - زيت الزيتون : 2 ملعقة كبيرة \n" +
                "\n", "\n" +
                "2.\tاسلقي الحمص في قدر على النار مع رشة ملح لمدة ساعة. ضعي الحمص بعدها في الخلاط الكهربائي مع الثوم، الطحينة، عصير الليمون الحامض والملح. ضعي الحمص في طبق التقديم واسكبي زيت الزيتون فوقه، رشي الفلفل الأسود وزيّنيه بحبوب الحمص والبقدونس.\n",
                "https://youtu.be/VVKOcDDJy5g" , "https://jm3eia.com/");

        food fo1 = new food("سلطة كينوا", R.drawable.ke, "كوب من حبوب الكينوا. أربع أكواب من أوراق الجرجير. كوبان من أوراق الخس الخضراء. ضمة صغيرة من الكزبرة. حبتان من الجزر، مبشور خشن. حبتان من الشمندر المشوي، مقطع لشرائح رفيعة. ربع كوب من التوت البري المجفف. نصف كوب من اللوز المحمص. نصف حبة من عصير البرتقال. حبة من عصير الليمون. ملعقة كبيرة من العسل. ملعقتان كبيرتان من خل التفاح. نصف ملعقة صغيرة من الملح. ثلث كوب من زيت الزيتون.", "\n" +
                "غسل حبوب الكينوا، ثمّ تقليبها بقليل من زيت الزيتون في قدر على نار متوسطة، ثمّ غمرها بالماء الدافئ وتركها على نار هادئة لمدّة 20 دقيقة. وضع مكوّنات الصلصة في وعاء محكم الإغلاق، وخلطها جيداً. خلط الخضار والشمندر والجزر والتوت البري في وعاء عميق. إضافة نصف مقدار الصلصة وتقليبها مع الخضار. مزج الكينوا مع بقية الصلصة ثمّ إضافتها إلى وعاء السلطة. تقديم سلطة الكينوا مع القليل من شرائح اللوز المحمص.\n" +
                "\n",
                "https://youtu.be/GDei9aqAkzQ" , "https://jm3eia.com/");

        Appetizars.add(fo5);

        Appetizars.add(fo2);
        Appetizars.add(fo3);
        Appetizars.add(fo4);
        Appetizars.add(fo1);


        RecyclerView rv = findViewById(R.id.rv);

        rv.setHasFixedSize(true);
        RecyclerView.LayoutManager am = new LinearLayoutManager(this);
        rv.setLayoutManager(am);

        AppAdapter ap = new AppAdapter(Appetizars, this);
        rv.setAdapter(ap);
    }
}