package com.example.judur;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class MainActivity_sw extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main_sw);


        ArrayList<food> sweet = new ArrayList<>();

        food food1 = new food("كيكة زعفران ",R.drawable.cz,"كوبين ونص دقيق – ملعقة صغيرة بيكنق بودر – ربع ملعقة صغيرة ملح – 200 غرام زبدة – كوبين ونص سكر – 4 بيضات – كوب حليب سائل – ملعقة صغيرة هيل – ملعقة فانيليا – صوص الزعفران – ملعقة صغيرة زعفران – كوب سكر بودر – ملعقتين كبار حليب – ملعقة صغيرة ماء ورد" , "تحضير الصوص: نقوم بخلط السكر والحليب السائل مع ملعقة صغيرة من ماء الورد والزعفران حتى يصبح الخليط ثقيل وكثيف تحضير الكيك: نسخن الفرن على درجة حرارة 180 – نخلط الزبدة والسكر في وعاء لمدة 3 دقائق ثم نضيف البيض بالتدريج – ثم نضيف الهيل والفانيليا ونخلطهم لمدة دقيقة – نضيف الدقيق والبيكنق بودر والحليب بالتدريج حتى نحصل على خليط متجانس – نجهز الكيك وندهنه بالزيت ورشة دقيق ونصب خليط الكيك – ندخل الكيك الفرن على درجة حرارة 180 لمدة 45 دقيقة – عند التأكد من نضوج الكيك نخرجه من الفرن واتركه حتى يبرد تماما – ثم اخرجه من القالب و اسكب فوقه الخليط ");
        food food2 = new food("  جيزكيك",R.drawable.cc, "\n" +
                "كوب ونصف من البسكويت المملح المفتت. ربع كوب من الزبدة غير المملحة والمذابة. ملعقة كبيرة من العسل. تسعون غرامًا من الزبدة الطرية. مئتا غرامٍ من جبنة الكريم. نصف كوب من سكر البودرة. كوب من التوت الأزرق المعلب. كوبان من كريمة الخفق. فتات بسكويت مملح. توت للزينة.\n" +
                "\n", "تحضير العجينة: خلط فتات البسكويت المملح، والزبدة المذابة، والعسل وضغط مزيج الفتات في أسفل القالب ثم خبزه على حرارة مئة وسبعين درجة مئوية ولمدة أربع دقائق. تحضير الحشوة: خفق الزبدة، وجبنة الكريم، وسكر البودرة معاً حتى يصبح المزيج منفوشاً. فرد المزيج على العجينة ووضع في البراد ليتماسك. فرد طبقة التوت على طبقة جبنة الكريم. تغطية طبقة التوت الأزرق بكريمة الخفق ووضعها في البراد حتى تتماسك. إضافة الزينة على الوجه قبل التقديم.\n" +
                "\n");
        food food3 = new food("لقيمات ",R.drawable.lm, "كوب من الدقيق. ملعقتان كبيرتان من حليب البودرة. ملعقة صغيرة من الخميرة. ملعقة كبيرة من النشا. رشة من الملح. ملعقة كبيرة من السكر. كوب من الماء دافئ. زيت للقلي. سمسم للزينة. قطر للتسقية.\n" +
                "\n" , "\n" +
                "أحضري وعاءً كبيراً وضعي فيه جميع المكوّنات السابقة، ثم اخلطيها جيداً حتى تتكوّن لديك عجينة لينة تشبة خليط الكيك. غطّي العجينة بكيس بلاستيكي ثم قطعة قماش نظيفة، ثمّ اتركيها لتتخمّر لمدة ساعة ونصف حتى تلاحظي أنّ حجمها تضاعف. ضعي كميّةً كبيرةً من الزيت؛ بحيث تطفو حبات اللقيمات على الوجه. أمسكي العجينة بواسطة اليد وشكّليها على شكل كرات صغيرة الحجم واسكبيها بالزيت الساخن، اتركيها دون تحريك حتى تطفوا على الوجه ثم قلّبيها حتى تأخذ اللون الذهبي. ضعي اللقيمات في القطر البارد جداً، من ثم صفيها وضعيها في طبق التقديم ورشّي عليها القليل من السمسم الأبيض.\n" +
                "\n");
        food food4 = new food("قرص عقيلي",R.drawable.go, "\n" +
                "أربع بيضات. ملعقة كبيرة من الهيل المطحون. كوبان من الدقيق الأبيض. كوب وربع من السكّر الأبيض. ملعقة صغيرة من الزعفران المنقوع في أربع ملاعق من ماء الورد، وأربع ملاعق من الماء. نصف كوب من الحليب السائل. ربع ملعقة صغيرة من الخلّ. ثلاثة أرباع كوب من الزيت النباتي. ملعقتان صغيرتان ونصف من البيكنج باودر. ثلث كوب من السمسم المحمّص.\n" +
                "\n" , "نخفق البيض في وعاء مع السكّر حتّى ذوبان السكّر. نضيف الخل، والزيت النباتي، ونخلطهم من جديد. نسكب مزيج الزعفران تدريجيّاً مع الحليب بالتناوب، مع البيكنج باودر والدقيق، مع مراعاة استمراريّة الخفق المستمر للمكوّنات حتّى تتجانس. ندهن صينيّة الفرن بالطحينة، ثمّ نرش عليها السمسم. نسكب مزيج الكيك، ونضع الصينيّة داخل الفرن المحمّى مسبقاً، على درجة حرارة متوسّطة، ونتركه حتّى ينضج. نخرج الصينيّة من الفرن، ونقلب الكيكة على صحن التقديم، ونقدّمها.");
        food food5 = new food("بقلاوه ",R.drawable.ba,  "ملعقتان كبيرتان من السكر. ملعقة كبيرة من ماء الزهر. كوبان من الفستق المجروش. نصف كوب من الزبدة، والسمنة أو زيت الذرة. باكيت من عجينة الجلاش.", "إحضار طبق متوسط الحجم، وتسخين الفرن إلى درجة حرارة مئتي درجة مئوية، ثمَّ وضع السمنة والزبدة أو الزيت في قدر عميق وإذابة الزبدة على درجة حرارة منخفضة. وضع كلٍ من: ماء الورد، الفستق والسكر في طبق عميق، وتقليب المواد مع بعضها البعض إلى أن يتم خلطها جيداً، ثمَّ ترك الخليط جانباً. تقطيع العجينة باستخدام سكين بحيث تكون بنفس مقاس الطبق دون فصل الرقاقات عن بعضها البعض، ثمَّ وضع الطبق فوق العجينة، ثمَّ وضع نصف كمية الرقاقات في الطبق، وتوزيع الحشو فوقه، ووضع بقية الرقاقات فوق الفستق، ثمَّ تقطيع الرقاقات باستخدام السكين حسب الرغبة، وصب خليط السمنة والزبدة فوقها. إدخال العجينة إلى الفرن لمدة خمس وعشرين إلى ثلاثين دقيقة إلى أن تصبح مائلة إلى اللون الذهبي، ثمَّ إخراجها، وتوزيع القطر مباشرة فوقها وتركها إلى أن تصبح باردة.\n" +
                "\n");

        sweet.add(food1);
        sweet.add(food2);
        sweet.add(food3);
        sweet.add(food4);
        sweet.add(food5);

        RecyclerView rect =findViewById(R.id.recy);

        rect.setHasFixedSize(true);
        RecyclerView.LayoutManager am = new LinearLayoutManager(this);
        rect.setLayoutManager(am);

        SwAdapter sw = new SwAdapter(sweet,this);
        rect.setAdapter(sw);
    }
}